In [1]:
import pandas as pd

In [2]:
df={
    'EmployeeID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Department': ['HR', 'IT', 'Finance', 'IT', 'HR'],
    'Salary': [50000, 60000, 55000, 65000, 58000]
}

In [11]:
a=pd.DataFrame(df)

In [12]:
a

   EmployeeID     Name Department  Salary
0         101    Alice         HR   50000
1         102      Bob         IT   60000
2         103  Charlie    Finance   55000
3         104    David         IT   65000
4         105      Eva         HR   58000

In [13]:
name_salary = a[['Name', 'Salary']]

In [14]:
name_salary

      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   55000
3    David   65000
4      Eva   58000

In [15]:
average_salary_IT = a[a['Department'] == 'IT']['Salary'].mean()

In [16]:
average_salary_IT

62500.0

In [17]:
a['Bonus'] = a['Salary'] * 0.1

In [18]:
a

   EmployeeID     Name Department  Salary   Bonus
0         101    Alice         HR   50000  5000.0
1         102      Bob         IT   60000  6000.0
2         103  Charlie    Finance   55000  5500.0
3         104    David         IT   65000  6500.0
4         105      Eva         HR   58000  5800.0

In [19]:
a.rename(columns={'EmployeeID': 'ID'}, inplace=True)

In [20]:
a

    ID     Name Department  Salary   Bonus
0  101    Alice         HR   50000  5000.0
1  102      Bob         IT   60000  6000.0
2  103  Charlie    Finance   55000  5500.0
3  104    David         IT   65000  6500.0
4  105      Eva         HR   58000  5800.0

In [21]:
a.drop(columns=['Department'], inplace=True)

In [22]:
a

    ID     Name  Salary   Bonus
0  101    Alice   50000  5000.0
1  102      Bob   60000  6000.0
2  103  Charlie   55000  5500.0
3  104    David   65000  6500.0
4  105      Eva   58000  5800.0

In [23]:
#DataFrame Operations: Sales Analysis

In [24]:
sales_data = pd.DataFrame({
    'Month': ['Jan', 'Feb', 'Mar', 'Apr', 'May'],
    'Product_A': [150, 200, 250, 300, 350],
    'Product_B': [300, 250, 200, 150, 100]
})

In [25]:
sales_data

  Month  Product_A  Product_B
0   Jan        150        300
1   Feb        200        250
2   Mar        250        200
3   Apr        300        150
4   May        350        100

In [26]:
total_sales_A = sales_data['Product_A'].sum()
total_sales_B = sales_data['Product_B'].sum()

In [28]:
total_sales_A

1250

In [29]:
total_sales_B

1000

In [30]:
highest_sales_month_A = sales_data.loc[sales_data['Product_A'].idxmax(), 'Month']

In [31]:
highest_sales_month_A

'May'

In [32]:
sales_data['Total_Sales'] = sales_data['Product_A'] + sales_data['Product_B']

In [33]:
sales_data

  Month  Product_A  Product_B  Total_Sales
0   Jan        150        300          450
1   Feb        200        250          450
2   Mar        250        200          450
3   Apr        300        150          450
4   May        350        100          450

In [34]:
sales_data['Product_A_Normalized'] = sales_data['Product_A'] / sales_data['Product_A'].max()

In [35]:
sales_data

  Month  Product_A  Product_B  Total_Sales  Product_A_Normalized
0   Jan        150        300          450              0.428571
1   Feb        200        250          450              0.571429
2   Mar        250        200          450              0.714286
3   Apr        300        150          450              0.857143
4   May        350        100          450              1.000000

In [38]:
filtered= sales_data[sales_data['Total_Sales'] > 400]

In [39]:
filtered

  Month  Product_A  Product_B  Total_Sales  Product_A_Normalized
0   Jan        150        300          450              0.428571
1   Feb        200        250          450              0.571429
2   Mar        250        200          450              0.714286
3   Apr        300        150          450              0.857143
4   May        350        100          450              1.000000

In [40]:
# Handling Missing Data: Customer Data

In [41]:
customer_data = pd.DataFrame({
    'CustomerID': [1, 2, 3, 4, 5],
    'Name': ['John', 'Jane', None, 'Alice', 'Bob'],
    'Purchase': [200, 300, 150, None, 500]
})

In [42]:
customer_data

   CustomerID   Name  Purchase
0           1   John     200.0
1           2   Jane     300.0
2           3   None     150.0
3           4  Alice       NaN
4           5    Bob     500.0

In [44]:
missing = customer_data.isnull().sum()

In [45]:
missing

CustomerID    0
Name          1
Purchase      1
dtype: int64

In [46]:
customer_data['Name'].fillna('Unknown', inplace=True)

In [47]:
customer_data

   CustomerID     Name  Purchase
0           1     John     200.0
1           2     Jane     300.0
2           3  Unknown     150.0
3           4    Alice       NaN
4           5      Bob     500.0

In [48]:
purchase_median = customer_data['Purchase'].median()

In [49]:
purchase_median

250.0

In [50]:
customer_data['Purchase'].fillna(purchase_median, inplace=True)

In [51]:
customer_data

   CustomerID     Name  Purchase
0           1     John     200.0
1           2     Jane     300.0
2           3  Unknown     150.0
3           4    Alice     250.0
4           5      Bob     500.0

In [52]:
customer_data.dropna(inplace=True)

In [53]:
customer_data

   CustomerID     Name  Purchase
0           1     John     200.0
1           2     Jane     300.0
2           3  Unknown     150.0
3           4    Alice     250.0
4           5      Bob     500.0

In [54]:
median_purchase = customer_data['Purchase'].median()

In [55]:
median_purchase

250.0

In [56]:
high_value_customers = customer_data[customer_data['Purchase'] > median_purchase]

In [57]:
high_value_customers

   CustomerID  Name  Purchase
1           2  Jane     300.0
4           5   Bob     500.0

In [58]:
# Merging DataFrames: Product Orders

In [59]:
orders = pd.DataFrame({
    'OrderID': [1, 2, 3, 4, 5],
    'CustomerID': [101, 102, 103, 104, 101],
    'Product': ['A', 'B', 'A', 'C', 'B'],
    'Quantity': [2, 1, 4, 2, 3]
})

In [60]:
orders

   OrderID  CustomerID Product  Quantity
0        1         101       A         2
1        2         102       B         1
2        3         103       A         4
3        4         104       C         2
4        5         101       B         3

In [61]:
customers = pd.DataFrame({
    'CustomerID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Location': ['New York', 'Los Angeles', 'Chicago', 'Houston']
})

In [62]:
customers

   CustomerID     Name     Location
0         101    Alice     New York
1         102      Bob  Los Angeles
2         103  Charlie      Chicago
3         104    David      Houston

In [63]:
merged_data = pd.merge(orders, customers, on='CustomerID')

In [64]:
merged_data

   OrderID  CustomerID Product  Quantity     Name     Location
0        1         101       A         2    Alice     New York
1        5         101       B         3    Alice     New York
2        2         102       B         1      Bob  Los Angeles
3        3         103       A         4  Charlie      Chicago
4        4         104       C         2    David      Houston

In [65]:
total = merged_data.groupby('Location')['Quantity'].sum()

In [66]:
total

Location
Chicago        4
Houston        2
Los Angeles    1
New York       5
Name: Quantity, dtype: int64

In [67]:
highest= merged_data.groupby('Name')['OrderID'].count().idxmax()

In [68]:
highest

'Alice'

In [69]:
merged_data['Total_Quantity'] = merged_data.groupby('Product')['Quantity'].cumsum()

In [70]:
merged_data

   OrderID  CustomerID Product  Quantity     Name     Location  Total_Quantity
0        1         101       A         2    Alice     New York               2
1        5         101       B         3    Alice     New York               3
2        2         102       B         1      Bob  Los Angeles               4
3        3         103       A         4  Charlie      Chicago               6
4        4         104       C         2    David      Houston               2

In [71]:
filtered_data = merged_data[merged_data['Product'].isin(['A', 'B'])]

In [72]:
filtered_data

   OrderID  CustomerID Product  Quantity     Name     Location  Total_Quantity
0        1         101       A         2    Alice     New York               2
1        5         101       B         3    Alice     New York               3
2        2         102       B         1      Bob  Los Angeles               4
3        3         103       A         4  Charlie      Chicago               6